EA/src/InformationRegisters/ПравилаОбменаДаннымиУзлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ПравилаОбменаДаннымиУзлов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПравилаОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаОбменаДанными</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

EA/src/InformationRegisters/ПравилаОбменаДаннымиУзлов/Ext/ManagerModule.bsl
// Функция - Получить правила обмена узла
//
// Параметры:
//  УзелИнформационнойБазы	 - ПланОбменаСсылка - ссылка узла, для которого требуется получить правила обмена
// 
// Возвращаемое значение:
//   - СправочникСсылка.ПравилаОбменаДанными, Неопределено - текущие установленные правила обмена для узла
//
Функция ПолучитьПравилаОбменаУзла( УзелИнформационнойБазы ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр( "УзелИнформационнойБазы", УзелИнформационнойБазы );
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПравилаОбменаДаннымиУзлов.ПравилаОбмена КАК ПравилаОбмена
	|ИЗ
	|	РегистрСведений.ПравилаОбменаДаннымиУзлов КАК ПравилаОбменаДаннымиУзлов
	|ГДЕ
	|	ПравилаОбменаДаннымиУзлов.УзелИнформационнойБазы = &УзелИнформационнойБазы";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПравилаОбмена;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
